---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesEdgeMatchForWidthAll
source: html/1b92c153-4c3a-9ca3-5cff-fee65b5b77de.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesProfilesEdgeMatchForWidthAll Property

Division family cannot be used with the selected edge condition for all widths of hosts

## Syntax (C#)
```csharp
public static FailureDefinitionId DivideVolumesProfilesEdgeMatchForWidthAll { get; }
```